const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '崇拜-薛之谦',
        duration: '03:46',
        headerpic: 'https://y.qq.com/music/photo_new/T002R300x300M000002sx6IJ3HFhXW_1.jpg?max_age=2592000',
        pic: 'http://p2.music.126.net/nx9GveBZOPJuWlyXYLVYkQ==/109951168679333995.jpg?imageView&thumbnail=360y360&quality=75&tostatic=0',
        audio: 'https://m801.music.126.net/20230626101413/627b4143a2712d538ac8735f8092ffee/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/20039035960/1f9e/264e/ec16/8d0d06ba96c04eb36209a2c50af06e88.m4a',
        lyric: "[00:00.00] 作词 : 薛之谦/子望\n[00:01.00] 作曲 : 薛之谦/郭冠廷\n[00:19.47]我有一个幼稚的想法\n[00:26.79]给你一个约束我的魔法\n[00:33.90]我变成雪人的话就可以慢慢融化\n[00:41.22]让你收下我最美的年华\n[00:46.29]\n[00:48.48]我还有一个无知的想法\n[00:55.86]抛弃世界吧就剩我们俩\n[01:03.18]若现实不是童话我就变成你的白马\n[01:09.75]只带你去摘下用我伤疤灌溉的鲜花\n[01:16.86]\n[01:20.70]我崇拜你回眸一笑就万里火海\n[01:28.44]能明白我孤独的存在\n[01:34.26]世间万般等待不及你口先开要不要跟我来\n[01:45.45]\n[01:50.01]可好奇怪你回眸一笑就爱恨重来\n[01:57.90]我还在用上次的遗骸\n[02:03.81]只要记忆还在我就不知悔改让你满意离开\n[02:15.12]\n[02:20.34]我给你一个阻止我的办法\n[02:27.63]从现在开始不准说真话\n[02:34.98]你提问我来回答输的人慢慢木化\n[02:41.67]但愿我很优雅伤口还能长出你爱的花\n[02:48.93]\n[02:48.99]我崇拜你回眸一笑就刀山火海\n[02:56.55]我本来应该一生无爱\n[03:02.34]世间好多遗憾一切都有替代但除了你以外\n[03:13.02]\n[03:18.27]躲不开你回眸一笑我卷土重来\n[03:25.86]我大概没你就不存在\n[03:31.62]只要你还缅怀我会洁身自爱继续我的崇拜\n[03:43.08]\n[03:56.70]我崇拜可好奇怪\n[04:11.28]我崇拜又躲不开\n[04:19.62]\n[04:39.45]爱上了你以来耗尽所有崇拜我已不复存在\n[04:40.22] 制作人：周以力\n[04:41.00] 编曲：周以力\n[04:41.78] 吉他：张凇\n[04:42.56] 配唱：关皓译\n[04:43.34] 人声编辑：黎子琨\n[04:44.12] 人声录音师：黎子琨\n[04:44.90] 弦乐：曜爆甘音乐工作室\n[04:45.68] 弦乐监制：蔡曜宇\n[04:46.46] 第一小提琴：陈奕勇/骆思云/沈羿彣 \n[04:47.24] 第二小提琴：黄雨柔/黄瑾诤/甘威鹏\n[04:48.01] 中提琴：潘自琦/牟啟东\n[04:48.79] 大提琴 ：叶欲新 /白竹君\n[04:49.57] 弦乐录音师：张闵翔\n[04:50.35] 弦乐录音室：强力录音室\n[04:51.13] 长号：刘书畅/林伟文 \n[04:51.91] 圆号：于浩洋/缪尚辰\n[04:52.69] 铜管录音师：黄彦翔/关皓聪@凌音音乐Ascentone music\n[04:53.47] 贝斯：陈然然\n[04:54.25] 鼓：武勇恒\n[04:55.03] 鼓录音师：邢铜\n[04:55.80] 混音/母带：全相彦@okmaster\n"
        
    }
}
const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}